<!DOCTYPE html>
<html>
<head lang="de">
    <meta charset="UTF-8">
    <title>About</title>
    <link href="../../css/bootstrap.min.css" rel="stylesheet">
    <link href="../../css/bootstrap-theme.min.css" rel="stylesheet">
    <link href="../../css/smoothness/jquery-ui-1.10.4.min.css" rel="stylesheet">
</head>
<body>
<div class="container" role="main">
    <div class="jumbotron">
        <h1>AddressBook - Search, Find, Phone</h1>

        <p>By Peter Kurfer, Thomas Mildner, Marina Birkhof, Monika Rau</p>
    </div>
    <p>Was haben Freunde, Bekannte, Verwandte, Chef und Kollegen gemeinsam? Charakter? Empathie?
        Bekanntenkreis? Weit gefehlt… Sie alle sind auf einen Klick in unserem exklusiven AdressBook
        zu finden. Witzig, interessant, n&uuml;tzlich – dies waren unter anderem die Vorgaben zum Projekt
        f&uuml;r die Zweitsemester der Informatik im Modul Programmieren. In einem geschlossenen Team aus
        vier Personen mit unterschiedlichem Fachwissen haben wir unter diesen Vorgaben beschlossen,
        ein ganz besonderes Adress-Buch mit dem Titel „AdressBook – Search, Find, Phone“ in der
        Hochsprache „Java“ zu entwickeln, das nicht nur Telefonnummern, sondern bei Bedarf auch Wohnorte
        oder Geburtsdaten preisgibt.</p>

    <h3>AGB – Datenschutzbestimmungen – Impressum </h3>
    <ol>
        <li>1. Inhalt des Angebotes und Datenschutzbestimmungen der Projektentwickler
            <p>Die Inhalte unseres Projekts „AdressBook – Search, Find, Phone“ wurden mit gr&ouml;&szlig;ter Sorgfalt
                erstellt. F&uuml;r
                die Korrektheit, Vollst&auml;ndigkeit, Qualit&auml;t und Aktualit&auml;t der bereitgestellten
                Informationen k&ouml;nnen wir
                jedoch keinerlei Gew&auml;hr &uuml;bernehmen. Sie unterliegen au&szlig;erdem dem deutschen Urheberrecht.
                Haftungsanspr&uuml;che gegen die Projektentwickler, die sich auf Sch&auml;den materieller oder ideeller
                Art
                beziehen oder die durch die Nutzung oder Nichtnutzung der dargebotenen Informationen bzw. durch die
                Nutzung fehlerhafter und unvollst&auml;ndiger Informationen verursacht wurden, sind grunds&auml;tzlich
                ausgeschlossen – sofern seitens der Entwickler kein nachweislich vors&auml;tzliches oder grob fahrl&auml;ssiges
                Verschulden vorliegt.</p>

            <p>Diesbez&uuml;glich m&ouml;chten wir explizit darauf hinweisen, dass s&auml;mtliche Angaben &uuml;ber pers&ouml;nliche
                Details wie
                z.B. Name, Adresse, Wohnort und Telefonnummern frei von den Mitgliedern des Projekts erfunden wurden.
                Allerdings ist eine &Uuml;berschneidung mit der Realit&auml;t jener oben genannten Details durchaus
                nicht
                auszuschlie&szlig;en – wir in einem solchen Fall jedoch keine Haftung &uuml;bernehmen. </p>

            <p>All unsere Angebote sind freibleibend und unverbindlich. Die Projektentwickler halten es sich
                ausdr&uuml;cklich vor, Teile der Seiten oder das gesamte Angebot ohne gesonderte, zeitnahe Ank&uuml;ndigung
                zu
                ver&auml;ndern, zu erg&auml;nzen, zu l&ouml;schen oder die Ver&ouml;ffentlichung zeitweise oder endg&uuml;ltig
                einzustellen. </p>
        </li>
        <li>Demo- und Entwicklungsumgebung
            <p>Zur Entwicklung haben sich die Projektentwickler f&uuml;r „IntelliJ Idea 13.1.2 Community Edition“
                entschieden. Des Weiteren wird f&uuml;r Continous Integration Maven verwendet, um etwaige Bibliotheken
                zu
                laden, die Anwendung zu builden und die „JavaDoc“ zu erstellen.</p>

            <p>Folgenden Bibliotheken werden im Projekt verwendet: Xerial SQLite-JDBC, JUnit und ControlsFX f&uuml;r die
                Notifcations, Warnungen und diverse GUI-Elemente au&szlig;erdem einige Funktionen von Java8 wie
                foreach() bei
                Collections, die neue Time-API und Lambdas. Die Ausf&uuml;hrung erfolgt in aktuellem JRE8 inkl.
                JavaFX8. </p>
        </li>
    </ol>

</div>

<script src="../../js/jquery-1.11.1.min.js"></script>
<script src="../../js/bootstrap.min.js"></script>
<script src="../../js/jquery-ui-1.10.4.min.js"></script>
</body>
</html>